In [57]:
import pandas as pd
import numpy as np
data = pd.read_csv('https://raw.githubusercontent.com/nerthard/lil-pandas-guide/master/adult.data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

1) Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [39]:
print(data[data.sex == 'Male'].sex.count())
print(data[data.sex == 'Female'].sex.count())

21790
10771

2) Каков средний возраст (признак age) женщин?

In [16]:
data[data['sex'] == 'Female'].age.mean()

36.85823043357163

3) Какова доля граждан Германии (признак native-country)?

In [46]:
germanpipl = data[data['native-country'] == 'Germany'].sex.count()
allpeople = data.sex.count()
germanpipl/allpeople

0.004207487485028101

4) Каковы средние значения возраста тех, кто получает более 50K в год (признак salary)?

In [49]:
data[data.salary == '>50K']['age'].mean()

44.24984058155847

5) Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [130]:
columns_to_show = ['age']
table = data.groupby(['race', 'sex'])[columns_to_show].describe()
table

                               age                                          \
                             count       mean        std   min   25%   50%
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0


                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [131]:
table.loc['Amer-Indian-Eskimo','Male']['age']['max']

82.0

# Задание на поиск двоечников по математике из таблиц Excel

In [163]:
namesp = pd.read_excel('C:\\Users\\nerth\\Documents\\GitHub\\pandas\\lil-pandas-guide-master\\name.xlsx')
namesp

   id     name
0   1  Safonov
1   2   Ivanov
2   3   Anikin
3   4  Sidorov
4   5   Krulov

In [164]:
objectp = pd.read_excel('C:\\Users\\nerth\\Documents\\GitHub\\pandas\\lil-pandas-guide-master\\objects.xlsx')

In [141]:
objectp

    id     object  value
0    1       math      2
1    2       math      5
2    3       math      3
3    4       math      4
4    5       math      3
5    1         OS      3
6    2         OS      5
7    3         OS      4
8    4         OS      3
9    5         OS      2
10   1  sociology      5
11   2  sociology      4
12   3  sociology      3
13   4  sociology      3
14   5  sociology      4

In [165]:
merges = pd.merge(namesp, objectp, how='outer')
merges

    id     name     object  value
0    1  Safonov       math      2
1    1  Safonov         OS      3
2    1  Safonov  sociology      5
3    2   Ivanov       math      5
4    2   Ivanov         OS      5
5    2   Ivanov  sociology      4
6    3   Anikin       math      2
7    3   Anikin         OS      4
8    3   Anikin  sociology      3
9    4  Sidorov       math      4
10   4  Sidorov         OS      3
11   4  Sidorov  sociology      3
12   5   Krulov       math      3
13   5   Krulov         OS      2
14   5   Krulov  sociology      4

In [180]:
mathes = merges[merges['object'] == 'math']
mathes

    id     name object  value
0    1  Safonov   math      2
3    2   Ivanov   math      5
6    3   Anikin   math      2
9    4  Sidorov   math      4
12   5   Krulov   math      3

In [181]:
mathes[mathes['value'] == 2]

   id     name object  value
0   1  Safonov   math      2
6   3   Anikin   math      2